In [2]:
# merging 

# concat 

import numpy as np 
import pandas as pd 

# creating a dataframe
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index= [0,1,2,3]
)

In [3]:
df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)

In [4]:
df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)

In [5]:
frames = [df1, df2, df3]

In [6]:
# concating the frames

# concat makes a full copy of data and iteratively using concat can create unnecessary copies. Thats why collect the objects in the list before concating.

result = pd.concat(frames)

In [7]:
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [8]:
# joins 

df4 = pd.DataFrame(
    {
        "B": ["B2", "B3", "B6", "B7"],
        "D": ["D2", "D3", "D6", "D7"],
        "F": ["F2", "F3", "F6", "F7"],
    },
    index=[2, 3, 6, 7],
)

In [9]:
result = pd.concat([df1, df4], axis= 1)

In [10]:
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [11]:
# inner join            # takes the intersection of the axis value.

result = pd.concat([df1, df4], axis= 1, join= 'inner')

result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [12]:
# reindexing

result = pd.concat([df1, df4], axis= 1).reindex(df1.index)

result          # excludes the row 4 and 5 because they are not in the df1.

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [13]:
# ignore_index ignores the overlapping indexes.

result = pd.concat([df1, df4], ignore_index= True)

result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [15]:
# creating a customers and transaction table 

customers = pd.DataFrame({
    "customer_id": [1, 2, 3, 4],
    "customer_name": ["Ram", "Sita", "Hari", "Gita"],
    "city": ["Kathmandu", "Pokhara", "Kathmandu", "Biratnagar"]
})


transactions = pd.DataFrame({
    "transaction_id": [101, 102, 103, 104, 105],
    "customer_id": [1, 2, 2, 5, 1],
    "amount": [500, 1200, 800, 400, 700]
})

In [16]:
customers

   customer_id customer_name        city
0            1           Ram   Kathmandu
1            2          Sita     Pokhara
2            3          Hari   Kathmandu
3            4          Gita  Biratnagar

In [17]:
transactions

   transaction_id  customer_id  amount
0             101            1     500
1             102            2    1200
2             103            2     800
3             104            5     400
4             105            1     700

In [ ]:
# merging

#inner join 

merged_dataset = pd.merge(customers, transactions, on= 'customer_id', how= 'inner')

merged_dataset

   customer_id customer_name       city  transaction_id  amount
0            1           Ram  Kathmandu             101     500
1            1           Ram  Kathmandu             105     700
2            2          Sita    Pokhara             102    1200
3            2          Sita    Pokhara             103     800

In [21]:
# left join 

left_join = pd.merge(customers, transactions, on= 'customer_id', how= 'left')

left_join

   customer_id customer_name        city  transaction_id  amount
0            1           Ram   Kathmandu           101.0   500.0
1            1           Ram   Kathmandu           105.0   700.0
2            2          Sita     Pokhara           102.0  1200.0
3            2          Sita     Pokhara           103.0   800.0
4            3          Hari   Kathmandu             NaN     NaN
5            4          Gita  Biratnagar             NaN     NaN

In [23]:
# right join 

right_join = pd.merge(customers, transactions, on= 'customer_id', how='right')

right_join

   customer_id customer_name       city  transaction_id  amount
0            1           Ram  Kathmandu             101     500
1            2          Sita    Pokhara             102    1200
2            2          Sita    Pokhara             103     800
3            5           NaN        NaN             104     400
4            1           Ram  Kathmandu             105     700

In [ ]:
# concat --- stacking data row wise

new_customers = pd.DataFrame(
    {
    "customer_id": [5, 6],
    "customer_name": ["Nabin", "Asha"],
    "city": ["Lalitpur", "Bhaktapur"]
    }
)

In [25]:
new_customers

   customer_id customer_name       city
0            5         Nabin   Lalitpur
1            6          Asha  Bhaktapur

In [26]:
combined_customers = pd.concat([customers, new_customers], axis= 0, ignore_index= True)

In [27]:
combined_customers

   customer_id customer_name        city
0            1           Ram   Kathmandu
1            2          Sita     Pokhara
2            3          Hari   Kathmandu
3            4          Gita  Biratnagar
4            5         Nabin    Lalitpur
5            6          Asha   Bhaktapur

In [31]:
# column wise concat 

customer_age = pd.DataFrame({
    'age': [25,30,35,28]
})

customer_with_age = pd.concat([customers, customer_age], axis=1)

customer_with_age

   customer_id customer_name        city  age
0            1           Ram   Kathmandu   25
1            2          Sita     Pokhara   30
2            3          Hari   Kathmandu   35
3            4          Gita  Biratnagar   28

In [35]:
# find total transaction amount per customer 

total_spent = transactions.groupby('customer_id')['amount'].sum().reset_index()

total_spent

   customer_id  amount
0            1    1200
1            2    2000
2            5     400

In [36]:
# merging with the customer table 

customer_spending = pd.merge(customers, total_spent, on='customer_id', how= 'left')

customer_spending

   customer_id customer_name        city  amount
0            1           Ram   Kathmandu  1200.0
1            2          Sita     Pokhara  2000.0
2            3          Hari   Kathmandu     NaN
3            4          Gita  Biratnagar     NaN

In [ ]:
# identify customers with no transactions 

customer_spending[customer_spending['amount'].isna()]       # here isna looks after the missing and empty values

   customer_id customer_name        city  amount
2            3          Hari   Kathmandu     NaN
3            4          Gita  Biratnagar     NaN

In [39]:
# replace nan amounts with 0 

customer_spending['amount'] = customer_spending['amount'].fillna(0)

customer_spending

   customer_id customer_name        city  amount
0            1           Ram   Kathmandu  1200.0
1            2          Sita     Pokhara  2000.0
2            3          Hari   Kathmandu     0.0
3            4          Gita  Biratnagar     0.0